# Takeout Sales

In [1]:
#!pip install pandas
#!pip install kaggle

#zipfile, sys, and importlib comes installed with base version of Python

Kaggle API Documentation (to download dataset): https://www.kaggle.com/docs/api

In [2]:
# Modules + Versions

from importlib.metadata import version #Check Module Versions
import sys #Check Python Version

import kaggle #dataset download (API)
import zipfile #unzip dataset 
import pandas as pd

print("Python Version:", sys.version)
print("Kaggle Module Version: ", version('kaggle'))
print("Kaggle Module Version: ", version('pandas'))

Python Version: 3.12.0 (tags/v3.12.0:0fb18b0, Oct  2 2023, 13:03:39) [MSC v.1935 64 bit (AMD64)]
Kaggle Module Version:  1.6.17
Kaggle Module Version:  2.1.3

In [3]:
# download dataset (w/ Kaggle API)
!kaggle datasets download -d henslersoftware/19560-indian-takeaway-orders

Dataset URL: https://www.kaggle.com/datasets/henslersoftware/19560-indian-takeaway-orders
License(s): copyright-authors
Downloading 19560-indian-takeaway-orders.zip to c:\Users\brend\Desktop\takeout-sales

  0%|          | 0.00/1.31M [00:00<?, ?B/s]
 76%|███████▌  | 1.00M/1.31M [00:00<00:00, 3.27MB/s]
100%|██████████| 1.31M/1.31M [00:00<00:00, 4.02MB/s]

In [4]:
# extract zip file to 'data' folder
zip_name = '19560-indian-takeaway-orders.zip'
with zipfile.ZipFile(zip_name, 'r') as file:
    file.extractall('data')

In [55]:
# load restaurant data into two dataframes - restaurant A and restaurant B
rest_A = pd.read_csv('data/restaurant-1-orders.csv')
rest_B = pd.read_csv('data/restaurant-2-orders.csv')

In [56]:
#Check for null values
print(rest_A.isnull().sum())
print(rest_B.isnull().sum())

Order Number      0
Order Date        0
Item Name         0
Quantity          0
Product Price     0
Total products    0
dtype: int64
Order ID          0
Order Date        0
Item Name         0
Quantity          0
Product Price     0
Total products    0
dtype: int64

In [57]:
# check data types
rest_A.info()
rest_B.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74818 entries, 0 to 74817
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order Number    74818 non-null  int64
 1   Order Date      74818 non-null  object
 2   Item Name       74818 non-null  object
 3   Quantity        74818 non-null  int64
 4   Product Price   74818 non-null  float64
 5   Total products  74818 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 3.4+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119183 entries, 0 to 119182
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Order ID        119183 non-null  int64
 1   Order Date      119183 non-null  object
 2   Item Name       119183 non-null  object
 3   Quantity        119183 non-null  int64
 4   Product Price   119183 non-null  float64
 5   Total products  119183 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 5.5+ MB

In [58]:
#Check Date column datatype
print(type(rest_A['Order Date'].iloc[0]))
print(type(rest_B['Order Date'].iloc[0]))
rest_A.head()

<class 'str'>
<class 'str'>

,Order Number,Order Date,Item Name,Quantity,Product Price,Total products
0,16118,03/08/2019 20:25,Plain Papadum,2,0.80,6
1,16118,03/08/2019 20:25,King Prawn Balti,1,12.95,6
2,16118,03/08/2019 20:25,Garlic Naan,1,2.95,6
3,16118,03/08/2019 20:25,Mushroom Rice,1,3.95,6
4,16118,03/08/2019 20:25,Paneer Tikka Masala,1,8.95,6

In [60]:
#convert Date column to date type
rest_A['Order Date'] = pd.to_datetime(rest_A['Order Date'], format = "%d/%m/%Y %H:%M")
rest_B['Order Date'] = pd.to_datetime(rest_A['Order Date'], format = "%d/%m/%Y %H:%M")
rest_A.head()

,Order Number,Order Date,Item Name,Quantity,Product Price,Total products
0,16118,2019-08-03 20:25:00,Plain Papadum,2,0.80,6
1,16118,2019-08-03 20:25:00,King Prawn Balti,1,12.95,6
2,16118,2019-08-03 20:25:00,Garlic Naan,1,2.95,6
3,16118,2019-08-03 20:25:00,Mushroom Rice,1,3.95,6
4,16118,2019-08-03 20:25:00,Paneer Tikka Masala,1,8.95,6

In [61]:
# Check for recorded dates in both datasets
print(f'Recorded time period for restaurant A: {rest_A['Order Date'].min(), rest_A['Order Date'].max()}')
print(f'Recorded time period for restaurant A: {rest_B['Order Date'].min(), rest_B['Order Date'].max()}')

Recorded time period for restaurant A: (Timestamp('2015-09-01 14:42:00'), Timestamp('2019-08-03 20:25:00'))
Recorded time period for restaurant A: (Timestamp('2015-09-01 14:42:00'), Timestamp('2019-08-03 20:25:00'))

Note: will create two separate dashboards for each restaurant in Tableau.

In [63]:
rest_B.head()

,Order ID,Order Date,Item Name,Quantity,Product Price,Total products
0,25583,2019-08-03 20:25:00,Tandoori Mixed Grill,1,11.95,12
1,25583,2019-08-03 20:25:00,Madras Sauce,1,3.95,12
2,25583,2019-08-03 20:25:00,Mushroom Rice,2,3.95,12
3,25583,2019-08-03 20:25:00,Garlic Naan,1,2.95,12
4,25583,2019-08-03 20:25:00,Paratha,1,2.95,12

In [64]:
#  total_price = quantity * product_price
rest_A['total_price'] = rest_A['Quantity'] * rest_A['Product Price']
rest_B['total_price'] = rest_A['Quantity'] * rest_B['Product Price']

In [65]:
rest_A.head()

,Order Number,Order Date,Item Name,Quantity,Product Price,Total products,total_price
0,16118,2019-08-03 20:25:00,Plain Papadum,2,0.80,6,1.60
1,16118,2019-08-03 20:25:00,King Prawn Balti,1,12.95,6,12.95
2,16118,2019-08-03 20:25:00,Garlic Naan,1,2.95,6,2.95
3,16118,2019-08-03 20:25:00,Mushroom Rice,1,3.95,6,3.95
4,16118,2019-08-03 20:25:00,Paneer Tikka Masala,1,8.95,6,8.95

In [67]:
#rename columns
col_names = {
    "Order Number": "order_id",
    "Order Date": "date",
    "Item Name": "item"
}
rest_A.rename(col_names, axis = 1, inplace = True)
rest_B.rename(col_names, axis = 1, inplace = True)

In [68]:
rest_A.head()

,order_id,date,item,Quantity,Product Price,Total products,total_price
0,16118,2019-08-03 20:25:00,Plain Papadum,2,0.80,6,1.60
1,16118,2019-08-03 20:25:00,King Prawn Balti,1,12.95,6,12.95
2,16118,2019-08-03 20:25:00,Garlic Naan,1,2.95,6,2.95
3,16118,2019-08-03 20:25:00,Mushroom Rice,1,3.95,6,3.95
4,16118,2019-08-03 20:25:00,Paneer Tikka Masala,1,8.95,6,8.95

In [69]:
rest_B.head()

,Order ID,date,item,Quantity,Product Price,Total products,total_price
0,25583,2019-08-03 20:25:00,Tandoori Mixed Grill,1,11.95,12,23.90
1,25583,2019-08-03 20:25:00,Madras Sauce,1,3.95,12,3.95
2,25583,2019-08-03 20:25:00,Mushroom Rice,2,3.95,12,3.95
3,25583,2019-08-03 20:25:00,Garlic Naan,1,2.95,12,2.95
4,25583,2019-08-03 20:25:00,Paratha,1,2.95,12,2.95

In [73]:
rest_A.shape, rest_B.shape

((74818, 7), (119183, 7))

In [71]:
# export data

rest_A.to_csv('data/restaurant_A_cleaned.csv')
rest_B.to_csv('data/restaurant_B_cleaned.csv')